&НаСервере
Процедура ОбновитьСообщения()
	Сообщения.Очистить();
	СообщенияДиалога = GigaChat_Сервер.ПолучитьСообщенияДиалога(Новый УникальныйИдентификатор(ИдентификаторДиалога));
	Для Каждого СообщениеДиалога Из СообщенияДиалога Цикл
		НС = Сообщения.Добавить();
		НС.ИдентификаторСообщения = СообщениеДиалога.ИдентификаторСообщения;
		НС.ВремяОтправки = СообщениеДиалога.ДатаОтправки;
		НС.Содержимое = СообщениеДиалога.Содержимое;
		НС.ОтПользователя = СообщениеДиалога.ОтПользователя;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИдентификаторДиалога") <> Неопределено Тогда
		ИдентификаторДиалога = Новый УникальныйИдентификатор(Параметры.ИдентификаторДиалога);
	КонецЕсли;
	//
	Если Параметры.Свойство("Наименование") <> Неопределено Тогда
		Наименование = Параметры.Наименование;
	КонецЕсли;
	//
	ОбновитьСообщения();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСообщение(Команда)
	Содержимое = "";
	Если ВвестиСтроку(Содержимое,"Введите содержимое сообщения",0,Истина) Тогда
		НовоеСообщение = GigaChat_Сервер.СоздатьСообщение(Новый УникальныйИдентификатор(ИдентификаторДиалога),Содержимое);
		ОбновитьСообщения();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСообщение(Команда)
	ТД = ЭтаФорма.Элементы.Сообщения.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		GigaChat_Сервер.УдалитьСообщение(Новый УникальныйИдентификатор(ИдентификаторДиалога),Новый УникальныйИдентификатор(ТД.ИдентификаторСообщения),ТД.ОтПользователя);
		ОбновитьСообщения();	
	КонецЕсли;
КонецПроцедуры

